[{"content":"Components library - Contact Card ","description":"A simple contact card for your organization, with a simple pop in for additional contact information","objectID":"95058c60f980e2f53ae188105b73163a","permalink":"https://codelibrary.opendatasoft.com/components/contactcard/","relpermalink":"/components/contactcard/","section":"Components","tags":["component","template","card","contact","pop-in","modal"],"title":"Contact Card"},{"content":"Custom catalog card The catalog card represents the published datasets of that portal. (see Exploring a dataset from the catalog).\nThe platform allows to customize the catalog cards displayed in the catalog of the portal, by providing custom HTML and CSS to override the default version. This resource propose different versions and technical tricks that can be used to highlighted datasets by keywords or theme for example.\n","description":"Override default catalog cards to highlight key metadata for your business","objectID":"b79c03340780d19d4c28b20efa45d3fb","permalink":"https://codelibrary.opendatasoft.com/techtricks/catalogcards/","relpermalink":"/techtricks/catalogcards/","section":"Techtricks","tags":["catalog","metadata","render"],"title":"Catalog cards"},{"content":"Ods-analysis, a quick intro The technical documentation says :\nThis widget exposes the results of an analysis (as an object containing a results array and optionally an aggregations object) in a variable available in the scope. It can be used with AngularJS\u0026rsquo;s ngRepeat to simply build a table of analysis results.\nNormal people would say :\nOds-analysis is the way to get the values behind a chart ! What you can do with a chart, you can do the same with ods-analysis. You get the figures, and do whatever you want in your dashboard with the results !\nThe syntax is different, but options and parameters are pretty similar. You have a context, an X axis, you define series, optionnaly you sort the results. To conclude, we can say that : ods-analysis is the low level widget of ods-chart, its underlying layer !\n","description":"","objectID":"f07c3b45e407cf7d3a0ae25cfc8d718f","permalink":"https://codelibrary.opendatasoft.com/techtricks/odsanalysis/","relpermalink":"/techtricks/odsanalysis/","section":"Techtricks","tags":["ods-analysis","widget","aggregation","analyse","compute","aggregate"],"title":"ODS Analysis"},{"content":"Static maps, a quick introduction When your goal is to share a precise analysis of a theme, such as employment or demography, for given administrative territories, you may want to disable all interactions with the map. You will even probably want to have overseas territories right next to the other territories in order to visualize immediately how the measurement varies across these administrative areas.\nIn this situation, you might prefer a static colored picture over a classic map widget. The resource below shows you how to create such static analyses of administrative divisions.\n","description":"How to create fast analytics maps based on SVG static files and data aggregation","objectID":"e5b1b765a1b4aaa367dce91f92bc626e","permalink":"https://codelibrary.opendatasoft.com/techtricks/svgmaps/","relpermalink":"/techtricks/svgmaps/","section":"Techtricks","tags":["ods-maps","widget","map","compute","render"],"title":"SVG Maps"},{"content":"Empty Empty\nempty\n","description":"","objectID":"e5eb7aa11438d56efbf54e0482fa1ab1","permalink":"https://codelibrary.opendatasoft.com/templates/empty/","relpermalink":"/templates/empty/","section":"Templates","tags":["empty"],"title":"Empty"}]