[{"content":"Components library - Buttons  ","description":"Examples of different buttons with hover styles. Lightly styled buttons with which to build your pages and dashboards.","objectID":"0016e22cc17580b54e11ad46dab0eaeb","permalink":"https://codelibrary.opendatasoft.com/components/buttons/","relpermalink":"/components/buttons/","section":"Components","tags":["display","navigation","list"],"title":"Buttons"},{"content":"Components library - Contact Card  ","description":"A simple contact card for your organization, with a simple pop in for additional contact information.","objectID":"41ee537fddd27e6fa260506d76fd0d50","permalink":"https://codelibrary.opendatasoft.com/components/contact-card/","relpermalink":"/components/contact-card/","section":"Components","tags":["display","navigation","list"],"title":"Contact Card"},{"content":"Components library - Content Card Generic card to display your content. Some classes are available to easily style your titles, text and buttons.  ","description":"Generic card to display your content. Some classes are available to easily style your titles, text and buttons.","objectID":"6b3fdf5676aa9cfd676e898efc5684ed","permalink":"https://codelibrary.opendatasoft.com/components/content-card/","relpermalink":"/components/content-card/","section":"Components","tags":["navigation","list"],"title":"Content card"},{"content":"Components Library - Dropdown module  ","description":"This module proposes a dropdown menu with a modern look.","objectID":"728fefcbc2f7c7f8f9e71420dee3d8f8","permalink":"https://codelibrary.opendatasoft.com/components/dropdown-module/","relpermalink":"/components/dropdown-module/","section":"Components","tags":["display","navigation","list","filter"],"title":"Dropdown module"},{"content":"Components library - Image card  ","description":"A card with an image background, useful for home page navigation and sections.","objectID":"79d38ab15dfd7e9eec4a15949f7ed9fc","permalink":"https://codelibrary.opendatasoft.com/components/image-card/","relpermalink":"/components/image-card/","section":"Components","tags":["display","navigation","list"],"title":"Image card"},{"content":"Components library - KPIs  ","description":"KPI cards, to display aggregation and values.","objectID":"5d8f0b996727da1a32600129b1d5e123","permalink":"https://codelibrary.opendatasoft.com/components/kpis/","relpermalink":"/components/kpis/","section":"Components","tags":["display","navigation","list","aggregation"],"title":"KPIs"},{"content":"Components library - Search box  Show the ods-searchbox widget alongside a \u0026ldquo;search\u0026rdquo; button and a title. Below there\u0026rsquo;s a stand-alone version and a version inside a card.\n","description":"A stylized search box that allows searching for datasets in the catalog.","objectID":"ded49bd7af75832ef960f6cdef4a3c67","permalink":"https://codelibrary.opendatasoft.com/components/search-box/","relpermalink":"/components/search-box/","section":"Components","tags":["navigation"],"title":"Search box"},{"content":"Components library - Search module  ","description":"This module is a stylised search bar with a modern look.","objectID":"45f53d8b83c38eaa7f5e158542c830ff","permalink":"https://codelibrary.opendatasoft.com/components/search-module/","relpermalink":"/components/search-module/","section":"Components","tags":["navigation"],"title":"Search module"},{"content":"Sticky header Sticky content is one that will stay positioned once the user scrolls past it (i.e: stuck in position). Unlike position: fixed;, sticky content is limited by its container and will stop scrolling once the end of the parent element is reached.\nTo make an element sticky, you need to add the following CSS:\nposition: sticky; top: 0;\n ","description":"Sticky content will stay positioned once the user scrolls past it.","objectID":"c55cbd2fa4c82504e3ad091c24f7d077","permalink":"https://codelibrary.opendatasoft.com/components/sticky-header/","relpermalink":"/components/sticky-header/","section":"Components","tags":["navigation"],"title":"Sticky header"},{"content":"Components Library - Table Module  ","description":"This module proposes various uses and functionalities for a table with minimalistic styling.","objectID":"9ffd7f0b4b434acecf23afc9545228a9","permalink":"https://codelibrary.opendatasoft.com/components/table-module/","relpermalink":"/components/table-module/","section":"Components","tags":["display","list"],"title":"Table module"},{"content":"Custom catalog card The catalog card represents the published datasets of that portal. (see Exploring a dataset from the catalog).\nThe platform allows to customize the catalog cards displayed in the catalog of the portal, by providing custom HTML and CSS to override the default version. This resource propose different versions and technical tricks that can be used to highlighted datasets by keywords or theme for example.\n ","description":"Override default catalog cards to highlight key metadata for your business.","objectID":"b2dab4ba537bbfa229de5f76949ac944","permalink":"https://codelibrary.opendatasoft.com/widget-tricks/catalog-cards/","relpermalink":"/widget-tricks/catalog-cards/","section":"Widget tricks","tags":["display","navigation"],"title":"Catalog cards"},{"content":"Ods-analysis, a quick intro The technical documentation says :\nThis widget exposes the results of an analysis (as an object containing a results array and optionally an aggregations object) in a variable available in the scope. It can be used with AngularJS\u0026rsquo;s ngRepeat to simply build a table of analysis results.\nNormal people would say :\nOds-analysis is the way to get the values behind a chart ! What you can do with a chart, you can do the same with ods-analysis. You get the figures, and do whatever you want in your dashboard with the results !\nThe syntax is different, but options and parameters are pretty similar. You have a context, an X axis, you define series, optionnaly you sort the results. To conclude, we can say that : ods-analysis is the low level widget of ods-chart, its underlying layer !\n ","description":"This widget exposes the results of an analysis. It can be used to display aggregations like sums, averages, min or max of numerical values, as a table, a custom chart or advanced KPIs.","objectID":"cc16d3583037c57e2bcda019faaa9333","permalink":"https://codelibrary.opendatasoft.com/widget-tricks/ods-analysis/","relpermalink":"/widget-tricks/ods-analysis/","section":"Widget tricks","tags":["ods-analysis","aggregation","chart","display"],"title":"ODS Analysis"},{"content":"ods-color-gradient + ods-map : a choropleth alternative This map rendering technique allows to display on a map colored shaped based on the aggregation of a different dataset.\nOne dataset contains the data to make some statistical computation (Avg, sum, counting of numerical fields) and one dataset contains geographical information (geo shapes).\nThe technique is very similar to a join at processing time, to enrich statistical data with geographical data. The only prerequisit is, like for a regular join, having a shared key between datasets to make the numerical aggregation match its geo shape.\nBig advantages are mainly to not overweight the statistical dataset by a processing join and storing multiple times the same geo shape in the data. and secondly to choose the geographical granularity or administrative level only when you render the map. A same statistical dataset can now be rendered with several geographical referentials as long as it contains all the needed keys, codes or names to match the geographical shapes.\nFor example: inhabitant dataset of a country can be rendered by region, departement, cities and so on as long as you have the geographical dataset of each administrative layers.\nHow it works: the technique is to aggregate the data with the ods-color-gradient to obtain the color gradient as a color object. Then feed an ods-map with this color object.\n ","description":"This widget computes a gradient of colors based on a numerical aggregation. It's mainly used to color the shapes of a map for analytics purposes.","objectID":"60c773af58b46baa677f88a601ece01a","permalink":"https://codelibrary.opendatasoft.com/widget-tricks/ods-color-gradient/","relpermalink":"/widget-tricks/ods-color-gradient/","section":"Widget tricks","tags":["display","aggregation","geo"],"title":"Ods-color-gradient"},{"content":"Static maps, a quick introduction When your goal is to share a precise analysis of a theme, such as employment or demography, for given administrative territories, you may want to disable all interactions with the map. You will even probably want to have overseas territories right next to the other territories in order to visualize immediately how the measurement varies across these administrative areas.\nIn this situation, you might prefer a static colored picture over a classic map widget. The resource below shows you how to create such static analyses of administrative divisions.\n ","description":"How to create fast analytics maps based on SVG static files and data aggregation.","objectID":"83cd1b09633af823998053f9fa3404c5","permalink":"https://codelibrary.opendatasoft.com/widget-tricks/svg-maps/","relpermalink":"/widget-tricks/svg-maps/","section":"Widget tricks","tags":["geo","aggregation","display"],"title":"SVG Maps"}]